Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# Digest_TokensUsed.Text
source: Tokens Used
de: Verwendete Tokens
es: Tokens usados
fr: Tokens utilisés
ja: 使用トークン
zh_cn: 已用 Token

# Digest_StorageDelta.Text
source: Storage Delta
de: Speicher-Delta
es: Delta de almacenamiento
fr: Delta de stockage
ja: ストレージ増減
zh_cn: 存储增量

# Digest_LoadingDigestReports.Text
source: Loading digest reports...
de: Digest-Berichte werden geladen...
es: Cargando informes de resumen...
fr: Chargement des rapports de résumé...
ja: ダイジェスト レポートを読み込んでいます...
zh_cn: 正在加载摘要报告...

# CollMgr_DeleteConfirmTitle
source: Delete collection?
de: Sammlung löschen?
es: ¿Eliminar la colección?
ja: コレクションを削除しますか?
zh_cn: 删除合集？

# CollMgr_DeleteConfirmMessage
source: "{0}" will be deleted. Its documents stay in your Knowledge Vault, and its sub-collections move up one level. This cannot be undone.
de: "{0}" wird gelöscht. Die Dokumente bleiben in Ihrem Wissens-Tresor, und die Untersammlungen rücken eine Ebene nach oben. Dies kann nicht rückgängig gemacht werden.
es: "{0}" se eliminará. Sus documentos permanecen en su Bóveda de Conocimiento y sus subcolecciones suben un nivel. Esta acción no se puede deshacer.
ja: 「{0}」を削除します。ドキュメントは Knowledge Vault に残り、サブコレクションは 1 つ上の階層に移動します。この操作は元に戻せません。
zh_cn: “{0}”将被删除。其中的文档会保留在 Knowledge Vault 中，其子合集会上移一级。此操作无法撤消。

# CollMgr_BulkDeleteConfirmTitle
source: Delete collections?
de: Sammlungen löschen?
es: ¿Eliminar las colecciones?
ja: 選択したコレクションを削除しますか?
zh_cn: 删除所选合集？

# CollMgr_BulkDeleteConfirmMessage
source: Selected collections: {0}. Their documents stay in your Knowledge Vault, and sub-collections you did not select move up one level. This cannot be undone.
de: Ausgewählte Sammlungen: {0}. Die Dokumente bleiben in Ihrem Wissens-Tresor, und nicht ausgewählte Untersammlungen rücken eine Ebene nach oben. Dies kann nicht rückgängig gemacht werden.
es: Colecciones seleccionadas: {0}. Sus documentos permanecen en su Bóveda de Conocimiento y las subcolecciones no seleccionadas suben un nivel. Esta acción no se puede deshacer.
ja: 選択したコレクション: {0} 件。ドキュメントは Knowledge Vault に残り、選択していないサブコレクションは 1 つ上の階層に移動します。この操作は元に戻せません。
zh_cn: 已选合集：{0} 个。其中的文档会保留在 Knowledge Vault 中，未选中的子合集会上移一级。此操作无法撤消。

# CollMgr_DeleteConfirmButton
source: Delete
de: Löschen
es: Eliminar
ja: 削除
zh_cn: 删除

# CollMgr_ConfirmCancelButton
source: Cancel
de: Abbrechen
es: Cancelar
ja: キャンセル
zh_cn: 取消

# Plugin_UninstallConfirmTitle
source: Uninstall plugin?
de: Plugin deinstallieren?
es: ¿Desinstalar el plugin?
ja: プラグインをアンインストールしますか?
zh_cn: 卸载插件？

# Plugin_UninstallConfirmMessage
source: "{0}" will be uninstalled: its folder is deleted, together with any data the plugin keeps there. This cannot be undone.
de: "{0}" wird deinstalliert: Der Ordner wird gelöscht, zusammen mit allen Daten, die das Plugin dort speichert. Dies kann nicht rückgängig gemacht werden.
es: "{0}" se desinstalará: se elimina su carpeta, junto con los datos que el plugin guarda en ella. Esta acción no se puede deshacer.
ja: 「{0}」をアンインストールします。フォルダーは、プラグインがそこに保存しているデータと一緒に削除されます。この操作は元に戻せません。
zh_cn: 将卸载“{0}”：其文件夹及插件保存在其中的所有数据都会被删除。此操作无法撤消。

# Plugin_BulkUninstallConfirmTitle
source: Uninstall plugins?
de: Plugins deinstallieren?
es: ¿Desinstalar los plugins?
ja: 選択したプラグインをアンインストールしますか?
zh_cn: 卸载所选插件？

# Plugin_BulkUninstallConfirmMessage
source: Selected plugins: {0}. Their folders are deleted, together with any data the plugins keep there. This cannot be undone.
de: Ausgewählte Plugins: {0}. Ihre Ordner werden gelöscht, zusammen mit allen Daten, die die Plugins dort speichern. Dies kann nicht rückgängig gemacht werden.
es: Plugins seleccionados: {0}. Se eliminan sus carpetas, junto con los datos que los plugins guardan en ellas. Esta acción no se puede deshacer.
ja: 選択したプラグイン: {0} 件。各フォルダーは、プラグインがそこに保存しているデータと一緒に削除されます。この操作は元に戻せません。
zh_cn: 已选插件：{0} 个。它们的文件夹及插件保存在其中的所有数据都会被删除。此操作无法撤消。

# Plugin_UninstallConfirmButton
source: Uninstall
de: Deinstallieren
es: Desinstalar
ja: アンインストール
zh_cn: 卸载

# Plugin_ConfirmCancelButton
source: Cancel
de: Abbrechen
es: Cancelar
ja: キャンセル
zh_cn: 取消

# CollMgr_MoveInto.Text
source: Move into...
de: Verschieben nach...
es: Mover a...
ja: 移動先を選択...
zh_cn: 移动到...

# CollMgr_MoveTitle.Text
source: Move Collection
de: Sammlung verschieben
es: Mover colección
ja: コレクションを移動
zh_cn: 移动合集

# CollMgr_MoveDestination.Text
source: Destination
de: Ziel
es: Destino
ja: 移動先
zh_cn: 目标位置

# CollMgr_MoveNowhere.Text
source: There is nowhere to move this collection. Collections nest one level deep, so a collection with sub-collections stays at the top level.
de: Diese Sammlung kann nirgendwohin verschoben werden. Sammlungen lassen sich nur eine Ebene tief verschachteln, daher bleibt eine Sammlung mit Untersammlungen auf der obersten Ebene.
es: No hay ningún lugar al que mover esta colección. Las colecciones solo se anidan un nivel, así que una colección con subcolecciones permanece en el nivel superior.
ja: このコレクションの移動先はありません。コレクションは 1 階層までしか入れ子にできないため、サブコレクションを持つコレクションは最上位に置かれたままになります。
zh_cn: 此合集无处可移动。合集只能嵌套一层，因此包含子合集的合集会保留在顶层。

# CollMgr_MoveCancel.Content
source: Cancel
de: Abbrechen
es: Cancelar
ja: キャンセル
zh_cn: 取消

# CollMgr_MoveConfirm.Content
source: Move
de: Verschieben
es: Mover
ja: 移動
zh_cn: 移动

# CollMgr_MoveToTopLevel
source: Top level
de: Oberste Ebene
es: Nivel superior
ja: 最上位
zh_cn: 顶层

# CollMgr_MoveFailed
source: Failed to move the collection: {0}
de: Die Sammlung konnte nicht verschoben werden: {0}
es: No se pudo mover la colección: {0}
ja: コレクションを移動できませんでした: {0}
zh_cn: 无法移动合集：{0}

# HwAdvisor_GpuNotDetected
source: GPU not detected
de: Keine GPU erkannt
es: GPU no detectada
ja: GPU が検出されません
zh_cn: 未检测到 GPU

# HwAdvisor_NoDedicatedGpu
source: No dedicated GPU
de: Keine dedizierte GPU
es: Sin GPU dedicada
ja: 専用 GPU なし
zh_cn: 无独立显卡

# HwAdvisor_CpuNotDetected
source: CPU not detected
de: Keine CPU erkannt
es: CPU no detectada
ja: CPU が検出されません
zh_cn: 未检测到 CPU

# HwAdvisor_RamNotDetected
source: Not detected
de: Nicht erkannt
es: No detectada
ja: 検出されません
zh_cn: 未检测到

# HwAdvisor_UpToModelSize
source: Up to {0} parameter models
de: Modelle bis {0} Parameter
es: Modelos de hasta {0} parámetros
ja: 最大 {0} パラメーターのモデル
zh_cn: 最多 {0} 参数的模型

# HwAdvisor_GpuTierEntry
source: Entry
de: Einsteiger
es: Básica
ja: エントリー
zh_cn: 入门级

# HwAdvisor_GpuTierMainstream
source: Mainstream
de: Mittelklasse
es: Gama media
ja: メインストリーム
zh_cn: 主流级

# HwAdvisor_GpuTierPerformance
source: Performance
de: Leistung
es: Alto rendimiento
ja: パフォーマンス
zh_cn: 性能级

# HwAdvisor_GpuTierEnthusiast
source: Enthusiast
es: Entusiasta
ja: エンスージアスト
zh_cn: 发烧级

# HwAdvisor_GpuTierProfessional
source: Professional
de: Professionell
es: Profesional
ja: プロフェッショナル
zh_cn: 专业级

# HwAdvisor_PerfTierBasic
source: Basic
de: Basis
es: Básico
ja: ベーシック
zh_cn: 基础

# HwAdvisor_PerfTierStandard
source: Standard
es: Estándar
ja: スタンダード
zh_cn: 标准

# HwAdvisor_PerfTierPerformance
source: Performance
de: Leistung
es: Rendimiento
ja: パフォーマンス
zh_cn: 性能

# HwAdvisor_PerfTierHighEnd
source: High-End
de: Oberklasse
es: Gama alta
ja: ハイエンド
zh_cn: 高端

# HwAdvisor_PerfTierProfessional
source: Professional
de: Professionell
es: Profesional
ja: プロフェッショナル
zh_cn: 专业

# HwAdvisor_AdviceGpu
source: Your GPU ({0}) has {1} of VRAM, which enables GPU-accelerated inference for significantly faster responses.
de: Ihre GPU ({0}) hat {1} Videospeicher. Das ermöglicht GPU-beschleunigte Inferenz und deutlich schnellere Antworten.
es: Su GPU ({0}) tiene {1} de VRAM, lo que permite inferencia acelerada por GPU con respuestas mucho más rápidas.
ja: お使いの GPU ({0}) には {1} の VRAM があり、GPU による高速な推論で応答が大幅に速くなります。
zh_cn: 您的 GPU ({0}) 有 {1} 显存，可进行 GPU 加速推理，响应速度明显更快。

# HwAdvisor_AdviceNoGpu
source: No dedicated GPU detected. Models will run on CPU, which is slower but still functional. Consider a GPU with at least 8GB VRAM for the best experience.
de: Keine dedizierte GPU erkannt. Modelle laufen auf der CPU, was langsamer ist, aber funktioniert. Für die beste Leistung empfiehlt sich eine GPU mit mindestens 8 GB VRAM.
es: No se detectó ninguna GPU dedicada. Los modelos se ejecutarán en la CPU, que es más lenta pero funciona. Para obtener la mejor experiencia, considere una GPU con al menos 8 GB de VRAM.
ja: 専用 GPU が検出されませんでした。モデルは CPU で実行されます。速度は落ちますが動作します。快適に使うには 8 GB 以上の VRAM を備えた GPU をお勧めします。
zh_cn: 未检测到独立显卡。模型将在 CPU 上运行，速度较慢但仍可使用。为获得最佳体验，建议使用至少 8 GB 显存的 GPU。

# HwAdvisor_AdviceUnder4
source: With limited memory, stick to small models (3B parameters or less). These models are fast and surprisingly capable for basic tasks.
de: Bei knappem Speicher bleiben Sie am besten bei kleinen Modellen (bis 3B Parameter). Sie sind schnell und für einfache Aufgaben erstaunlich leistungsfähig.
es: Con poca memoria, limítese a modelos pequeños (3B parámetros o menos). Son rápidos y sorprendentemente capaces para tareas básicas.
ja: メモリが限られているため、小さなモデル (3B パラメーター以下) をお使いください。高速で、基本的な作業には十分な性能があります。
zh_cn: 内存有限时，请使用小型模型（3B 参数及以下）。这些模型速度快，处理基本任务的能力出人意料。

# HwAdvisor_AdviceUnder8
source: You can run 7B parameter models comfortably. These provide a great balance of quality and speed for most everyday AI tasks.
de: Sie können Modelle mit 7B Parametern problemlos ausführen. Sie bieten für die meisten alltäglichen KI-Aufgaben eine gute Balance aus Qualität und Geschwindigkeit.
es: Puede ejecutar cómodamente modelos de 7B parámetros. Ofrecen un gran equilibrio entre calidad y velocidad para la mayoría de las tareas de IA cotidianas.
ja: 7B パラメーターのモデルを快適に実行できます。日常的な AI 作業の多くで、品質と速度のバランスに優れています。
zh_cn: 您可以流畅运行 7B 参数的模型。对于大多数日常 AI 任务，它们在质量和速度之间取得了很好的平衡。

# HwAdvisor_AdviceUnder16
source: Your system can handle up to 13B parameter models, offering strong performance across chat, code, and reasoning tasks.
de: Ihr System bewältigt Modelle bis 13B Parameter und liefert starke Leistung bei Chat, Code und logischem Denken.
es: Su sistema admite modelos de hasta 13B parámetros, con un gran rendimiento en chat, código y razonamiento.
ja: このシステムは最大 13B パラメーターのモデルを扱え、チャット、コード、推論の各作業で高い性能を発揮します。
zh_cn: 您的系统可运行最多 13B 参数的模型，在聊天、代码和推理任务中表现出色。

# HwAdvisor_AdviceOver16
source: Your hardware is excellent for local AI. You can run large 30-70B parameter models for near-frontier quality reasoning and generation.
de: Ihre Hardware eignet sich hervorragend für lokale KI. Sie können große Modelle mit 30-70B Parametern ausführen, mit Schlussfolgerungen und Texten nahe an Spitzenmodellen.
es: Su hardware es excelente para IA local. Puede ejecutar modelos grandes de 30-70B parámetros, con razonamiento y generación de calidad cercana a la de los modelos más avanzados.
ja: このハードウェアはローカル AI に最適です。30-70B パラメーターの大規模モデルを実行でき、最先端に近い品質の推論と生成が可能です。
zh_cn: 您的硬件非常适合本地 AI。您可以运行 30-70B 参数的大型模型，获得接近前沿水平的推理和生成质量。

# HwAdvisor_AdviceNpu
source: NPU detected ({0}). Some models may leverage your NPU for additional acceleration.
de: NPU erkannt ({0}). Manche Modelle können die NPU für zusätzliche Beschleunigung nutzen.
es: NPU detectada ({0}). Algunos modelos pueden aprovechar la NPU para acelerar aún más.
ja: NPU が検出されました ({0})。一部のモデルは NPU を使ってさらに高速化できます。
zh_cn: 检测到 NPU（{0}）。部分模型可借助 NPU 进一步加速。

# HwAdvisor_AdviceDetectionFailed
source: Hardware detection could not finish. Check that Agent-X has the permissions it needs, then select Re-scan.
de: Die Hardwareerkennung konnte nicht abgeschlossen werden. Prüfen Sie, ob Agent-X die nötigen Berechtigungen hat, und wählen Sie dann "Erneut scannen".
es: La detección de hardware no pudo completarse. Compruebe que Agent-X tiene los permisos necesarios y seleccione Volver a analizar.
ja: ハードウェアの検出を完了できませんでした。Agent-X に必要な権限があることを確認してから、[再スキャン] を選択してください。
zh_cn: 硬件检测未能完成。请确认 Agent-X 拥有所需权限，然后选择“重新扫描”。

# HwAdvisor_Unknown
source: Unknown
de: Unbekannt
es: Desconocido
ja: 不明
zh_cn: 未知

# HwAdvisor_DetectionFailed
source: Detection failed
de: Erkennung fehlgeschlagen
es: Error de detección
ja: 検出に失敗しました
zh_cn: 检测失败

# HwAdvisor_CpuCoreCount
source: {0}-core CPU
de: CPU mit {0} Kernen
es: CPU de {0} núcleos
ja: {0} コア CPU
zh_cn: {0} 核 CPU

# HwAdvisor_UnableToDetermine
source: Unable to determine
de: Nicht bestimmbar
es: No se puede determinar
ja: 判定できません
zh_cn: 无法确定

# HwAdvisor_DetectionFailedError
source: Hardware detection failed. Some information may be unavailable.
de: Die Hardwareerkennung ist fehlgeschlagen. Einige Informationen sind möglicherweise nicht verfügbar.
es: La detección de hardware ha fallado. Parte de la información puede no estar disponible.
ja: ハードウェアの検出に失敗しました。一部の情報を利用できない可能性があります。
zh_cn: 硬件检测失败。部分信息可能不可用。

# HwAdvisor_InstallFailed
source: Failed to install {0}. Open the Model Manager for detailed download progress.
de: {0} konnte nicht installiert werden. Den genauen Downloadfortschritt zeigt die Modellverwaltung.
es: No se pudo instalar {0}. Abra el Gestor de modelos para ver el progreso detallado de la descarga.
ja: {0} をインストールできませんでした。ダウンロードの詳しい進行状況はモデル マネージャーで確認できます。
zh_cn: 无法安装 {0}。打开模型管理器可查看详细的下载进度。

# HwAdvisor_ModelPhi3Mini
source: Microsoft Phi-3 Mini (3.8B) -- Surprisingly capable for its size. Great for quick Q&A and summarization.
de: Microsoft Phi-3 Mini (3.8B) -- Für seine Größe erstaunlich leistungsfähig. Ideal für schnelle Fragen und Zusammenfassungen.
es: Microsoft Phi-3 Mini (3.8B) -- Sorprendentemente capaz para su tamaño. Ideal para preguntas rápidas y resúmenes.
ja: Microsoft Phi-3 Mini (3.8B) -- サイズの割に高性能。手早い質疑応答や要約に最適です。
zh_cn: Microsoft Phi-3 Mini (3.8B) -- 以其体量而言能力出众。非常适合快速问答和摘要。

# HwAdvisor_ModelQwen25Tiny
source: Alibaba Qwen 2.5 (0.5B) -- Ultra-lightweight model, fast responses with basic reasoning.
de: Alibaba Qwen 2.5 (0.5B) -- Ultraleichtes Modell mit schnellen Antworten und einfachem logischem Denken.
es: Alibaba Qwen 2.5 (0.5B) -- Modelo ultraligero con respuestas rápidas y razonamiento básico.
ja: Alibaba Qwen 2.5 (0.5B) -- 超軽量モデル。基本的な推論で素早く応答します。
zh_cn: Alibaba Qwen 2.5 (0.5B) -- 超轻量模型，响应迅速，具备基础推理能力。

# HwAdvisor_ModelQwen25Coder1_5b
source: Qwen 2.5 Coder (1.5B) -- Lightweight code completion and generation.
de: Qwen 2.5 Coder (1.5B) -- Leichte Codevervollständigung und -generierung.
es: Qwen 2.5 Coder (1.5B) -- Completado y generación de código ligeros.
ja: Qwen 2.5 Coder (1.5B) -- 軽量なコード補完とコード生成。
zh_cn: Qwen 2.5 Coder (1.5B) -- 轻量级代码补全与生成。

# HwAdvisor_ModelAllMiniLm
source: Sentence Transformers MiniLM -- Fast, efficient text embeddings for semantic search.
de: Sentence Transformers MiniLM -- Schnelle, effiziente Text-Embeddings für die semantische Suche.
es: Sentence Transformers MiniLM -- Embeddings de texto rápidos y eficientes para la búsqueda semántica.
ja: Sentence Transformers MiniLM -- セマンティック検索向けの高速で効率的なテキスト埋め込み。
zh_cn: Sentence Transformers MiniLM -- 快速高效的文本嵌入，适用于语义搜索。

# HwAdvisor_ModelLlama32
source: Meta Llama 3.2 (3B) -- Excellent balance of quality and speed for everyday tasks.
de: Meta Llama 3.2 (3B) -- Ausgezeichnete Balance aus Qualität und Geschwindigkeit für alltägliche Aufgaben.
es: Meta Llama 3.2 (3B) -- Excelente equilibrio entre calidad y velocidad para las tareas cotidianas.
ja: Meta Llama 3.2 (3B) -- 日常的な作業に最適な、品質と速度のバランスに優れたモデル。
zh_cn: Meta Llama 3.2 (3B) -- 在日常任务中兼顾质量与速度。

# HwAdvisor_ModelMistral7b
source: Mistral 7B -- Fast, versatile, and great at following instructions.
de: Mistral 7B -- Schnell, vielseitig und hält sich gut an Anweisungen.
es: Mistral 7B -- Rápido, versátil y muy bueno siguiendo instrucciones.
ja: Mistral 7B -- 高速で汎用性が高く、指示にもよく従います。
zh_cn: Mistral 7B -- 速度快、用途广，能很好地遵循指令。

# HwAdvisor_ModelQwen25Coder7b
source: Qwen 2.5 Coder (7B) -- Solid code generation, completion, review, and debugging.
de: Qwen 2.5 Coder (7B) -- Solide Codegenerierung, -vervollständigung, -prüfung und Fehlersuche.
es: Qwen 2.5 Coder (7B) -- Generación, completado, revisión y depuración de código sólidos.
ja: Qwen 2.5 Coder (7B) -- コードの生成、補完、レビュー、デバッグを堅実にこなします。
zh_cn: Qwen 2.5 Coder (7B) -- 可靠的代码生成、补全、审查与调试。

# HwAdvisor_ModelLlama31_8b
source: Meta Llama 3.1 (8B) -- Top-tier open model. Excellent for chat, analysis, and writing.
de: Meta Llama 3.1 (8B) -- Offenes Spitzenmodell. Hervorragend für Chat, Analyse und Schreiben.
es: Meta Llama 3.1 (8B) -- Modelo abierto de primer nivel. Excelente para chat, análisis y redacción.
ja: Meta Llama 3.1 (8B) -- トップクラスのオープン モデル。チャット、分析、文章作成に優れています。
zh_cn: Meta Llama 3.1 (8B) -- 顶级开放模型。非常适合聊天、分析和写作。

# HwAdvisor_ModelMistralLatest
source: Mistral 7B v0.3 -- Fast and instruction-tuned. Great all-rounder.
de: Mistral 7B v0.3 -- Schnell und auf Anweisungen abgestimmt. Ein starker Allrounder.
es: Mistral 7B v0.3 -- Rápido y ajustado para seguir instrucciones. Un gran todoterreno.
ja: Mistral 7B v0.3 -- 高速で指示に合わせて調整済み。万能に使えるモデルです。
zh_cn: Mistral 7B v0.3 -- 速度快，经过指令微调。出色的全能型模型。

# HwAdvisor_ModelDeepSeekR1_8b
source: DeepSeek R1 (8B) -- Strong reasoning model with chain-of-thought capabilities.
de: DeepSeek R1 (8B) -- Starkes Reasoning-Modell mit schrittweisem Denken (Chain of Thought).
es: DeepSeek R1 (8B) -- Potente modelo de razonamiento con cadena de pensamiento.
ja: DeepSeek R1 (8B) -- 思考の連鎖 (Chain of Thought) による高い推論能力を持つモデル。
zh_cn: DeepSeek R1 (8B) -- 具备思维链能力的强推理模型。

# HwAdvisor_ModelPhi3Medium
source: Microsoft Phi-3 Medium (14B, Q4) -- Strong reasoning in a compact package.
de: Microsoft Phi-3 Medium (14B, Q4) -- Starkes logisches Denken in kompakter Form.
es: Microsoft Phi-3 Medium (14B, Q4) -- Gran capacidad de razonamiento en un formato compacto.
ja: Microsoft Phi-3 Medium (14B, Q4) -- コンパクトながら高い推論能力。
zh_cn: Microsoft Phi-3 Medium (14B, Q4) -- 体积紧凑，推理能力强。

# HwAdvisor_ModelDeepSeekCoderV2
source: DeepSeek Coder V2 (16B) -- Advanced code understanding across 300+ languages.
de: DeepSeek Coder V2 (16B) -- Fortgeschrittenes Codeverständnis in über 300 Programmiersprachen.
es: DeepSeek Coder V2 (16B) -- Comprensión avanzada de código en más de 300 lenguajes.
ja: DeepSeek Coder V2 (16B) -- 300 以上の言語に対応した高度なコード理解。
zh_cn: DeepSeek Coder V2 (16B) -- 支持 300 多种语言的高级代码理解。

# HwAdvisor_ModelNomicEmbed
source: Nomic Embed Text -- High-quality embeddings with 8K context window.
de: Nomic Embed Text -- Hochwertige Embeddings mit einem Kontextfenster von 8K.
es: Nomic Embed Text -- Embeddings de alta calidad con una ventana de contexto de 8K.
ja: Nomic Embed Text -- 8K のコンテキスト ウィンドウを持つ高品質な埋め込み。
zh_cn: Nomic Embed Text -- 高质量嵌入，上下文窗口为 8K。

# HwAdvisor_ModelLlama31_70b
source: Meta Llama 3.1 (70B, Q4) -- Flagship open model. Near-GPT-4 quality for complex tasks.
de: Meta Llama 3.1 (70B, Q4) -- Offenes Flaggschiffmodell. Nahezu GPT-4-Qualität bei komplexen Aufgaben.
es: Meta Llama 3.1 (70B, Q4) -- Modelo abierto insignia. Calidad cercana a GPT-4 en tareas complejas.
ja: Meta Llama 3.1 (70B, Q4) -- フラッグシップのオープン モデル。複雑な作業で GPT-4 に迫る品質。
zh_cn: Meta Llama 3.1 (70B, Q4) -- 旗舰级开放模型。复杂任务接近 GPT-4 水平。

# HwAdvisor_ModelQwen25_32b
source: Alibaba Qwen 2.5 (32B) -- Exceptional multilingual model with strong reasoning.
de: Alibaba Qwen 2.5 (32B) -- Außergewöhnliches mehrsprachiges Modell mit starkem logischem Denken.
es: Alibaba Qwen 2.5 (32B) -- Modelo multilingüe excepcional con un razonamiento sólido.
ja: Alibaba Qwen 2.5 (32B) -- 高い推論能力を備えた優れた多言語モデル。
zh_cn: Alibaba Qwen 2.5 (32B) -- 出色的多语言模型，推理能力强。

# HwAdvisor_ModelMistralLarge
source: Mistral Large -- Enterprise-grade model with excellent instruction following.
de: Mistral Large -- Modell für den Unternehmenseinsatz, das Anweisungen hervorragend befolgt.
es: Mistral Large -- Modelo de nivel empresarial que sigue las instrucciones de forma excelente.
ja: Mistral Large -- 指示への追従性に優れたエンタープライズ向けモデル。
zh_cn: Mistral Large -- 企业级模型，指令遵循能力出色。

# HwAdvisor_ModelLlama32Latest
source: Meta Llama 3.2 (3B) -- Fast, efficient option for quick everyday tasks.
de: Meta Llama 3.2 (3B) -- Schnelle, effiziente Wahl für kurze Alltagsaufgaben.
es: Meta Llama 3.2 (3B) -- Opción rápida y eficiente para tareas cotidianas breves.
ja: Meta Llama 3.2 (3B) -- 日常のちょっとした作業に向く、高速で効率的な選択肢。
zh_cn: Meta Llama 3.2 (3B) -- 快速高效，适合处理日常小任务。

# HwAdvisor_ModelQwen25Coder32b
source: Qwen 2.5 Coder (32B) -- Top-tier code model for complex multi-file tasks.
de: Qwen 2.5 Coder (32B) -- Spitzen-Codemodell für komplexe Aufgaben über mehrere Dateien.
es: Qwen 2.5 Coder (32B) -- Modelo de código de primer nivel para tareas complejas con varios archivos.
ja: Qwen 2.5 Coder (32B) -- 複数ファイルにまたがる複雑な作業に向くトップクラスのコード モデル。
zh_cn: Qwen 2.5 Coder (32B) -- 顶级代码模型，适合复杂的多文件任务。

# HwAdvisor_ModelMxbaiEmbedLarge
source: Mixedbread Embed Large -- State-of-the-art embeddings for RAG and search.
de: Mixedbread Embed Large -- Embeddings auf dem neuesten Stand für RAG und Suche.
es: Mixedbread Embed Large -- Embeddings de última generación para RAG y búsqueda.
ja: Mixedbread Embed Large -- RAG と検索向けの最先端の埋め込み。
zh_cn: Mixedbread Embed Large -- 用于 RAG 和搜索的先进嵌入模型。

# Settings_BuiltInLlm.Text
source: Built-in LLM (Local)
de: Integriertes LLM (lokal)
es: LLM integrado (local)
ja: 組み込み LLM (ローカル)
zh_cn: 内置 LLM(本地)

# Settings_GpuLayersAutomatic.Header
source: Automatic GPU layers
de: GPU-Schichten automatisch
es: Capas de GPU automáticas
ja: GPU レイヤーを自動設定
zh_cn: 自动设置 GPU 层

# Settings_GpuLayers.Text
source: GPU Layers
de: GPU-Schichten
es: Capas de GPU
ja: GPU レイヤー
zh_cn: GPU 层数

# Settings_GpuLayersHint.Text
source: Automatic picks 16 to 33 layers from an NVIDIA GPU's video memory (none below 2 GB); 0 keeps the model on the CPU. Layers run on the GPU only when the NVIDIA CUDA 12 Toolkit is installed. Saving reloads the built-in model.
de: Automatisch wählt 16 bis 33 Schichten nach dem Videospeicher einer NVIDIA-GPU (unter 2 GB keine); 0 lässt das Modell auf der CPU. Die Schichten laufen nur dann auf der GPU, wenn das NVIDIA CUDA 12 Toolkit installiert ist. Beim Speichern wird das integrierte Modell neu geladen.
es: Automático elige de 16 a 33 capas según la memoria de vídeo de una GPU NVIDIA (ninguna por debajo de 2 GB); 0 mantiene el modelo en la CPU. Las capas solo se ejecutan en la GPU si está instalado NVIDIA CUDA 12 Toolkit. Al guardar se vuelve a cargar el modelo integrado.
ja: 自動では NVIDIA GPU のビデオ メモリに応じて 16 から 33 のレイヤーを選びます (2 GB 未満では 0)。0 にするとモデルは CPU で動作します。レイヤーが GPU で動作するのは NVIDIA CUDA 12 Toolkit がインストールされている場合だけです。保存すると組み込みモデルが再読み込みされます。
zh_cn: 自动模式会根据 NVIDIA GPU 的显存选择 16 到 33 层（低于 2 GB 时为 0）；设为 0 则模型在 CPU 上运行。仅当安装了 NVIDIA CUDA 12 Toolkit 时，这些层才会在 GPU 上运行。保存后会重新加载内置模型。

# Digest_NoDigestReportsYet.Text
source: No Digest Reports Yet
de: Noch keine Digest-Berichte
es: Aún no hay informes de resumen
fr: Pas encore de rapports de résumé
ja: ダイジェスト レポートはまだありません
zh_cn: 暂无摘要报告

# Digest_GenerateYourFirstWeekly.Text
source: Generate your first weekly digest to see activity summaries, search trends, and conversation highlights.
de: Erstellen Sie Ihren ersten Wochen-Digest, um Aktivitätszusammenfassungen, Suchtrends und Konversations-Highlights zu sehen.
es: Genere su primer resumen semanal para ver resúmenes de actividad, tendencias de búsqueda y momentos destacados de las conversaciones.
fr: Générez votre premier résumé hebdomadaire pour voir les synthèses d'activité, les tendances de recherche et les temps forts des conversations.
ja: 最初の週次ダイジェストを生成すると、アクティビティの概要、検索トレンド、会話のハイライトが表示されます。
zh_cn: 生成您的第一份每周摘要,查看活动汇总、搜索趋势和会话亮点。

# Digest_GenerateFirstDigest.Text
source: Generate First Digest
de: Ersten Digest erstellen
es: Generar primer resumen
fr: Générer le premier résumé
ja: 最初のダイジェストを生成
zh_cn: 生成第一份摘要

# Digest_TopSearches.Text
source: Top Searches
de: Top-Suchanfragen
es: Búsquedas principales
fr: Recherches principales
ja: 上位の検索
zh_cn: 热门搜索

# Digest_NoSearchesRecordedThis.Text
source: No searches recorded this period
de: In diesem Zeitraum keine Suchanfragen erfasst
es: No se registraron búsquedas en este período
fr: Aucune recherche enregistrée sur cette période
ja: この期間に記録された検索はありません
zh_cn: 本时段未记录任何搜索

# Digest_TopCollections.Text
source: Top Collections
de: Top-Sammlungen
es: Colecciones principales
fr: Collections principales
ja: 上位のコレクション
zh_cn: 热门合集

# Digest_Docs.Text
source: docs
de: Dok.
ja: 件
zh_cn: 个文档
